Revit 2027 API
ReferenceIntersector.ViewId Property
 The id of the 3D view used for evaluation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId ViewId { get; set; }
Public Property ViewId As ElementId
	Get
	Set
public:
property ElementId^ ViewId {
	ElementId^ get ();
	void set (ElementId^ value);
}
member ViewId : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentException |  When setting this property: viewId is not the id of a 3D view.
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
ReferenceIntersector Class
Autodesk.Revit.DB Namespace